app/controllers/articles_controller.rb

  def create
    @article= Article.new(article_params)
    if @article.save
---
INSERT INTO "articles" ("title", "description") VALUES (?, ?)  [["title", "Earth"], ["description", "Earth is the planet which has life"]]

  def update
    @article=Article.find(params[:id])
    if @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "articles" SET "description" = ? WHERE "articles"."id" = ?  [["description", "Dreams will be fulfilled with the universe's wishes"], ["id", 11]]

  def index
    @article= Article.all
---
SELECT "articles".* FROM "articles"